Tekla Open API Reference for Tekla Structures 2025
DrawingEnumeratorBase Fields
The DrawingEnumeratorBase type exposes the following members.
Fields
Name | Description
SelectInstances
 Indicates that the instance Select() is called when the 'Current' item is asked from the enumerator. The user can set this to 'false' if no members are ever asked from the instance. This is the case when, for example, asking only a report property from the identifier. Warning: normally the user should not change this value.
Top
See Also
Reference
DrawingEnumeratorBase Class
Tekla.Structures.Drawing Namespace